Repository: zbyna/calibre-legie-plugin
Catalog: *.po
Languages: cs

source: Downloads metadata and covers from Legie.info (only books in Czech, mainly sci-fi and fantasy)
cs: Stahuje metadata a obálky z Legie.info (pouze knihy v češtině a slovenštině, převážně sci-fi a fantasy)

source: Plugin version: <b>%s</b> - Report errors and suggestions through <a href="https://www.mobileread.com/forums/showthread.php?t=362097">MobileRead</a> forum.
cs: Verze modulu: <b>%s</b> - Chyby a návrhy hlašte na <a href=“https://www.mobileread.com/forums/showthread.php?t=362097”>MobileRead</a> fórum.

source: Search
cs: Vyhledávání

source: Title and Authors
cs: Název a Autoři

source: Tags
cs: Štítky

source: Series
cs: Série

source: Publishers and Date
cs: Vydavatel a datum

source: Comments
cs: Komentáře

source: Identifiers
cs: Identifikátory

source: Searching priority
cs: Priorita vyhledávání

source: Title ids
cs: Id v Názvu

source: You can add identifiers into 'Title' field (in format identifier:value e.g. legie:123 or publisher:new_publisher) before you start metadata download and they will be used prior built-in one.Identifiers can be combined in title Identifiers available: 'legie' for books 'legie_povidka' for tales/poems 'isbn' and 'ean' for searching by isbn number (legie can search by ISBN without this prefixes too) Specify wanted issue when Author/Title matching with identifiers: 'publisher' for book issue publisher specification (use underscore '_' for spacing multiple words) 'pubdate' and 'pubyear' published edition year specification (e.g. pubdate:2024 will force plugin to prior search for issues from year 2024) 'lang' or 'language' for book language specification (lang:cs for czech and lang:sk for slovak) 'type' for book type specification (type:audio type:audiobook type:part type:tale type:book_part) 'search' for enabling specified search engine (search:google search:duckduckgo)
cs: Do pole ’Název’ můžete připsat identifikátory (ve formátu identifikátor:hodnota, např. databazeknih:123 nebo publisher:nový_vydavatel) před zahájením stahování metadat. Ty pak budou upřednostněny před vestavěnými identifikátory. Identifikátory v názvu můžete kombinovat. Dostupné identifikátory: ‘legie’ pro knihy ‘legie_povidka' pro povídky/básně (části díla) 'isbn' a 'ean' pro vyhledávání podle ISBN čísla Specifikace vydání při vyhledávání pomocí kombinace Autorů/Názvu: ‘publisher’ pro specifikaci vydavatele vydání knihy (u víceslovných názvů vydavatelství použijte namísto mezer podtržítko ‘_’) 'pubdate' a ‘pubyear’ pro specifikaci roku vydání knihy (publikované edice) (např. pubdate:2024 donutí modul k prioritnímu vyhledávání vydání z roku 2024) ‘lang’ nebo ‘language’ pro specifikaci jazyka (lang:cs pro české a lang:sk pro slovenské vydání)

source: If identifier found in book metadata, plugin will use it for faster book search. legie for books legie_povidka for poems/tales
cs: Pokud je identifikátor nalezen v metadatech knihy, modul jej použije pro rychlejší vyhledávání knih: legie pro knihy legie_povidka pro básně/povídky

source: Default
cs: Výchozí

source: Czech newest
cs: České nejnovější

source: Czech oldest
cs: České nejstarší

source: Slovak newest
cs: Slovenské nejnovější

source: Slovak oldest
cs: Slovenské nejstarší

source: Search for additional cover on Obalky knih
cs: Hledat další obálku na Obálky knih

source: Tries to search for additional cover using ISBN number on obalkyknih.cz site. Does not count into max cover limit option.
cs: Pokusí se pomocí získaného ISBN čísla vyhledat další obálku na webu obalkyknih.cz. Obálka se nezapočítává do celkového max limitu stahovaných obálek.

source: Add item (Alt+Shift+W)
cs: Přidat položku (Alt+Shift+W)

source: Delete item (Alt+Shift+S)
cs: Smazat položku (Alt+Shift+S)

source: Move left (Alt+Shift+A)
cs: Posunout doleva (Alt+Shift+A)

source: Move right (Alt+Shift+D)
cs: Posunout doprava (Alt+Shift+D)

source: Authors
cs: Autoři

source: Names of authors will be added into calibre authors metadata field.
cs: Jména autorů budou přidána do pole ‘Autoři’.

source: Translators
cs: Překladatelé

source: Names of translators will be added into calibre authors metadata field.
cs: Jména překladatelů budou přidána do pole ‘Autoři’.

source: Book cover authors
cs: Autoři obálek

source: Names of book cover authors will be added into calibre authors metadata field.
cs: Jména autorů obálek budou přidána do pole ‘Autoři’.

source: Illustrators
cs: Ilustrátoři

source: Names of illustrators will be added into calibre authors metadata field.
cs: Jména ilustrátorů budou přidána do pole ‘Autoři’.

source: Save authors with role
cs: Ukládat roli autora

source: Writes role (author, translator, illustrator...) after every author in Authors field. **WONT add role when only Author grabbing is checked
cs: Zapíše roli (autor, překlad, ilustrace…) za každým jménem autora v poli Autoři. **Nezapisuje roli, pokud je zvoleno pouze stahování Autorů

source: Swap authors names with last names
cs: Prohodit jméno a příjmení

source: Enable this option if you want to get names in Authors metadata field in format "Surname Name" **Global LN, FN Calibre option is prefered
cs: Pokud chcete ukládat jména ve stylu ‘Příjmení Jméno’ zvolte tuto možnost. ** Vestavěná možnost ‘Příjmení, Jméno’ je preferována před tímto nastavením

source: Get only one author
cs: Získat pouze jednoho autora

source: If the information about the book contains more authors - plugin will add only first one.
cs: Pokud má kniha vícero autorů - modul zapíše do pole 'Autoři' pouze prvního z nich.

source: Legie series and editions to calibre series and editions mappings
cs: Přemapování legie sérií a knižních edicí do sérií a knižních edicí ukládaných v calibre

source: Filter series/editions via mappings
cs: Filtrovat série a edice dle tabulky

source: Check this and only mapped series and editions below will get parsed to Calibre.
cs: Zaškrtněte tuto možnost a pouze namapované série a knižní edice se budou ukládat do metadat v Calibre.

source: series/editions
cs: série/edice

source: Series/editions
cs: Série/edice

source: Actual publication
cs: Aktuální publikace

source: First publication
cs: První publikace

source: Legie publishers to calibre publisher mappings
cs: Přemapování legie vydavatele na vydavatele ukládaného v calibre

source: Filter publishers via mappings
cs: Filtrovat vydavatele dle tabulky

source: Check this and only mapped publishers below will get parsed to Calibre.
cs: Zaškrtněte tuto možnost a pouze namapovaní vydavatelé se budou ukládat do metadat v Calibre.

source: publisher
cs: vydavatel

source: Publisher
cs: Vydavatel

source: Legie category to calibre tag mappings
cs: Přemapování legie kategorií na štítky ukládané do calibre

source: Filter category via mappings
cs: Filtrovat kategorii dle tabulky

source: Check this and only mapped category below will get parsed to Calibre.
cs: Zaškrtněte tuto možnost a pouze namapované kategorie se budou ukládat do metadat v Calibre.

source: Add item (Alt+A)
cs: Přidat položku (Alt+A)

source: Delete item (Alt+D)
cs: Smazat položku (Alt+D)

source: Add all items at once (Alt+Q)
cs: Smazat původní a přidat všechny dostupné položky (Alt+Q)

source: Reset to defaults (Alt+R)
cs: Restartovat do původního nastavení (Alt+R)

source: Move item up (Alt+W)
cs: Posunout nahoru (Alt+W)

source: Move item down (Alt+S)
cs: Posunout dolů (Alt+S)

source: Add mapping (Alt+A)
cs: Přidat pravidlo (Alt+A)

source: Delete mapping (Alt+D)
cs: Smazat pravidlo (Alt+D)

source: Rename item (Alt+S)
cs: Přejmenovat položku (Alt+S)

source: Reset to plugin default mappings (Alt+R)
cs: Restartovat do původního nastavení (Alt+R)

source: Description
cs: Popis

source: ——— (Horizontal line)
cs: ——— (Vodorovná čára)

source: Custom text
cs: Vlastní text

source: Pages count
cs: Počet stran

source: Cover type
cs: Vazba knihy

source: Print run
cs: Náklad

source: Audio length
cs: Délka (audiokniha)

source: Original title
cs: Původní název

source: Title
cs: Název

source: Original pubdate
cs: Rok vydání originálu

source: Publication date
cs: Rok vydání

source: Real authors
cs: Autoři (bez pseudonymů)

source: Interprets
cs: Interpreti

source: Series index
cs: Pořadí v sérii

source: Book Edition
cs: Knižní edice

source: Book Edition index
cs: Pořadí v knižní edici

source: Genre
cs: Žánr

source: Rating (%)
cs: Hodnocení (%)

source: Rating (0-5)
cs: Hodnocení (0-5)

source: Rating (0-10)
cs: Hodnocení (0-10)

source: Rating count
cs: Počet hodnocení

source: Site identifier
cs: Identifikátor webu/modulu

source: Awards
cs: Ocenění

source: Tales in book
cs: Seznam povídek/básní

source: Trivia
cs: Zajímavosti

source: Contained in books
cs: Také součástí těchto knih

source: Source relevance
cs: Pořadí ve vyhledávání

source: Price
cs: Cena

source: Language
cs: Jazyk

source: Dimensions
cs: Rozměry knihy

source: Issue number
cs: Specifikace vydání

source: Alternative titles
cs: Vydáno i pod názvy

source: Published separately as
cs: Část vydaná samostatně jako

source: World
cs: Svět

source: Alternative original title
cs: Jiný (obecně známý) název

source: Subtitle
cs: Podtitul

source: Note
cs: Poznámka

source: Category
cs: Kategorie

source: External links
cs: Externí odkazy

source: Restart plugin to defaults
cs: Obnovit modul do původního nastavení

source: Reset plugin to defaults (Alt+Shift+R)
cs: Restartovat modul do původního nastavení (Alt+Shift+R)

source: Are you sure?
cs: Jste si jisti?

source: Add item
cs: Přidat položku

source: Choose item:
cs: Vyberte položku:

source: Add custom text
cs: Přidat vlastní text

source: Write text:
cs: Napište text:

source: Are you sure you want to reset plugin to default settings?
cs: Opravdu chcete obnovit modul do výchozího nastavení?

source: Are you sure you want to delete the selected item?
cs: Opravdu chcete smazat vybranou položku?

source: Are you sure you want to delete selected mappings?
cs: Opravdu chcete smazat vybrané přemapování?

source: Are you sure you want to delete your order and add all available items?
cs: Opravdu chcete smazat vaše dosavadní sestavení Komentářů a vložit do sestavení všechny volitelné položky?

source: Are you sure you want to set builder to defaults?
cs: Opravdu chcete obnovit uspořádání položek do výchozího nastavení?

source: Are you sure you want to reset to the plugin default mappings?
cs: Opravdu chcete obnovit mapování položek do výchozího nastavení?

source: Add new mapping
cs: Přidat nové pravidlo

source: Enter a website name of an item to create a mapping for:
cs: Vložte %s z webu, pro který chcete vytvořit přemapování:

source: Rename mapping
cs: Přejmenovat mapování

source: Adding Failed
cs: Přidání se nezdařilo

source: Mapping with the same name already exists.
cs: Již existuje mapování se shodným názvem.

source: Renaming Failed
cs: Přejmenování se nezdařilo

source: An item with the same name already exists.
cs: Již existuje položka se shodným názvem.

source: How to create custom column from this Identificators? Check <a href="https://www.mobileread.com/forums/showpost.php?p=4361821&postcount=2">MobileRead</a> forum.
cs: Jak vytvořit vlastní sloupce ze speciálních <i>leg_</i> identifikátorů? Navštivte <a href=“https://www.mobileread.com/forums/showpost.php?p=4361821&postcount=2”>Mobileread</a> fórum.

source: Select what will be added into 'Identifiers' metadata field in Calibre
cs: Vyberte, co se bude ukládat do pole ‘Identifikátory’

source: Rating
cs: Hodnocení

source: Recalculate ratings
cs: Přepočítat hodnocení

source: Enable this option if you want to parse more accurate rating (it will be calculated from individual ratings) from site. If unchecked, only provided rating on main book page will be parsed.
cs: Povolte tuto možnost, jestli chcete získávat přesnější hodnocení (budou přepočítána z jednotlivých hodnocení) z webu. Pokud nezaškrtnete, bude využito méně přesné hodnocení ze stránky s knihou.

source: Max decimal places
cs: Maximální počet desetinných míst

source: With this option you can change accuracy of the float number. **ONLY in recalculated rating
cs: Pomocí této volby si můžete upravit přesnost přepočítávaných hodnocení. **Funkční POUZE se zaškrtnutou volbou Přepočítat hodnocení

source: Comment builder (What will be parsed into Comments field.)
cs: Vyberte, co a v jakém pořadí se bude ukládat do pole ‘Komentáře’

source: Select what will be added into 'Tags' metadata field in Calibre
cs: Vyberte, co se bude ukládat do pole ‘Štítky’

source: Set what will be parsed into Calibre 'Publisher' field
cs: Vyberte, co se bude ukládat do pole ‘Vydavatel’ v Calibre

source: Set what will be parsed into Calibre 'Published date' field
cs: Vyberte, co se bude ukládat do pole ‘Vydáno’ (datum vydání) v Calibre

source: You can select date of first publication or this publication to be parsed here.
cs: Můžete si vybrat, zda zde chcete zapisovat rok vydání originálu, anebo rok vydání konkrétní publikace.

source: Set what will be parsed into Calibre 'Series' column
cs: Vyberte, co se bude ukládat do pole ’Série’ v Calibre

source: Set what will be parsed into Calibre 'series_index'
cs: Vyberte, co se bude ukládat do pole ’Pořadí v sérii’ v Calibre

source: You can select any number value here.
cs: Můžete si vybrat, jednu z číselných hodnot, která zde bude zapsána. ** Objeví se pouze pokud bude existovat hodnota v poli ‘Série’.

source: Select what will be added into 'Authors' metadata field in Calibre
cs: Vyberte, co se bude ukládat do pole ‘Autoři’

source: Set what will be parsed into Calibre 'Title' column
cs: Vyberte, co se bude ukládat do pole ’Název’ v Calibre

source: Maximum title/author search matches to evaluate (1 = fastest):
cs: Maximální počet zobrazených výsledků hledání:

source: Number of maximum search results which you can get from site.
cs: Určí maximální počet výsledků, které můžete hledáním získat.

source: If isbn identifier found in book metadata, plugin will use it for faster book search.
cs: Pokud je v metadatech knihy nalezen isbn identifikátor, modul jej využije k rychlejšímu nalezení knihy.

source: Audiobook
cs: Audioknihy

source: Try to prefer audiobook issue of the book if exists.
cs: Modul bude upřednostňovat audioknihy před knihami/eknihami ve výběru vydání.

source: Books
cs: Knihy

source: Search for books using built-in search engine: whole title + last name of first author > only title + all authors > whole title > only one word from title (longest first) > > all authors > only one author > only one part of authors name using Google/DuckDuckGo search engine: title + all authors
cs: K vyhledávání knih využívá: při hledání přes vyhledávač na webu: název + příjmení prvního autora > název a všechny autory > pouze celý název > pouze jedno slovo z názvu (od nejdelších) > > všechny autory > pouze jednoho autora > pouze jednu část autorova jména při hledání přes Google/DuckDuckGo vyhledávač: název a všechny autory

source: Tales
cs: Povídky (Části díla)

source: Check this if you want to search in tales before searching in books. Search for tales/poems attempts: title + all authors > only whole title > only one word from title (longest first)
cs: Tuto možnost zaškrtněte, pokud chcete nejprve před vyhledáváním v knihách prohledat povídky. Modul vyhledává povídky v tomto pořadí: pomocí názvu + všech autorů > pouze názvu > pouze jednoho slova názvu (od nejdelších)

source: Search engine
cs: Vyhledávač

source: Google search
cs: Vyhledávání Google

source: Tries to search for book or tale/poem via google search engine prior to built-in site search.
cs: Zkusí najít knihu nebo povídku (část díla) pomocí vyhledávání Google. Pokud nenajde žádné výsledky, pokračuje ve vyhledávání pomocí dalšího vyhledávače.

source: DuckDuckGo search
cs: Vyhledávání DuckDuckGo

source: Tries to search for book or tale/poem via DuckDuckGo search engine prior to built-in site search.
cs: Zkusí najít knihu nebo povídku (část díla) pomocí vyhledávání DuckDuckGo. Pokud nenajde žádné výsledky, pokračuje ve vyhledávání pomocí dalšího vyhledávače.

source: Built-in search
cs: Vyhledávání na webu

source: Tries to search for book or tale/poem via built-in site search engine.
cs: Zkusí najít knihu nebo povídku (část díla) pomocí vyhledávání na webu.

source: Book issues
cs: Vydání knihy

source: Choose preferred book issue
cs: Vyberte preferované vydání knihy

source: Set which issue of the book will be preferred. You can choose between czech/slovak and oldest/newest. Default will be chosen if specified issue not found.
cs: Nastavte si, které vydání knihy bude preferováno. Můžete si vybrat mezi českým/slovenským a nejnovějším/nejstarším. Výchozí nalezené vydání knihy bude zvoleno, pokud to zde specifikované nebude dostupné.

source: Covers
cs: Obálky

source: Maximum covers from other issues to evaluate (1 = fastest):
cs: Maximální počet stahovaných obálek knihy:

source: Set max covers to download. Faster evaluating if set to 1 with Default preferred issue set When set to 0 - no covers will be downloaded. When set to 1 and preferred book issue option set to default - only default found issue cover will be downloaded. When set to >1 all covers from preferred issue language are downloaded - When preferred czech only all czech cover gets downloaded and vice-versa (default option recognizes language of default book) - oldest/newest order does matter if max cover option < available covers
cs: Zvolte maximální počet stahovaných obálek. Rychleji vyhledává, pokud je nastaveno na 1 (zároveň s volbou vydání knihy na Výchozí). Při volbě 0 - nebudou staženy žádné obálky. Při volbě 1 a zároveň preferovaného vydání knihy na Výchozí - pouze obálka výchozího vydání bude stažena Při volbě >1 se stáhnou pouze všechny obálky z preferovaného jazyka vydání. - při preferované češtině se stáhnou pouze všechny české obálky a naopak (volba Výchozí rozpozná jazyk výchozího vydání). - na pořadí nejstarší/nejnovější záleží, pokud je maximální počet stahovaných obálek < počet dostupných obálek

source: Comment item
cs: Položka komentáře

source: Tag item
cs: Položka štítku

source: Metadata Item
cs: Položka metadat

source: Identifier format
cs: Formát identifikátoru

source: Maps to Calibre
cs: Přemapovat na Calibre

source: Plugin version: <b>%s</b>
cs: Verze zásuvného modulu: <b>%s</b>
